УНФ_ТЕСТ/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъект</name>
    <type>
      <types>DefinedType.ПроизводственныйОбъектИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдрес</name>
    <comment>Внутренние значения полей адреса доставки (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСредстваИдентификации</name>
    <type>
      <types>EnumRef.ВидыСредствИдентификацииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаНачалаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>БезУчетаНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВвезенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретенПроизведенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <comment>Код товара в ИС МП</comment>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>EnumRef.ШаблоныКодовМаркировкиСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяРозничнаяЦена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособФормированияСерийногоНомера</name>
      <type>
        <types>EnumRef.СпособыФормированияСерийногоНомераСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевойПол</name>
      <type>
        <types>EnumRef.ЦелевойПолИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВводаВОборот</name>
      <type>
        <types>EnumRef.СпособыВводаВОборотСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнаяКатегория</name>
      <type>
        <types>EnumRef.ВозрастныеКатегорииИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/Forms/ФормаЗаполненияТовары/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидПродукции = Параметры.ВидПродукции;
	Наименование = Параметры.Наименование;
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	СтруктураРезультата = Новый Структура();
	
	СтруктураРезультата.Вставить("ПолноеОписаниеОстатков", ПолноеОписаниеОстатков);
	
	Если ЗаполнятьЦелевойПол Тогда
		СтруктураРезультата.Вставить("ЦелевойПол", ЦелевойПол);
	КонецЕсли;
	
	Если ЗаполнятьСпособВводаВОборот Тогда
		СтруктураРезультата.Вставить("СпособВводаВОборот", СпособВводаВОборот);
	КонецЕсли;
	
	Если ЗаполнятьТоварныйЗнак Тогда
		СтруктураРезультата.Вставить("ТоварныйЗнак", ТоварныйЗнак);
	КонецЕсли;
	
	Если ЗаполнятьМодель Тогда
		СтруктураРезультата.Вставить("Модель", Модель);
	КонецЕсли;
	
	Если ЗаполнятьВозрастнуюКатегорию Тогда
		СтруктураРезультата.Вставить("ВозрастнаяКатегория", ВозрастнаяКатегория);
	КонецЕсли;
	
	Если ЗаполнятьНаименование Тогда
		СтруктураРезультата.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура ЗаполнятьЦелевойПолПриИзменении(Элемент)
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьМодельПриИзменении(Элемент)
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьТоварныйЗнакПриИзменении(Элемент)
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьВозрастнуюКатегориюПриИзменении(Элемент)
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьСпосовВводаВОборотПриИзменении(Элемент)
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолноеОписаниеОстатковПриИзменении(Элемент)
	
	Если ПолноеОписаниеОстатков Тогда
		ЗаполнятьЦелевойПол         = Ложь;
		ЗаполнятьСпособВводаВОборот = Ложь;
		СпособВводаВОборот          = Неопределено;
		ЦелевойПол                  = Неопределено;
	КонецЕсли;
	
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьНаименованиеПриИзменении(Элемент)
	
	УправлениеДоступностьюЭлементовФорм(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностьюЭлементовФорм(Форма)
	
	Форма.Элементы.ГруппаЦелевойПол.ТолькоПросмотр         = Форма.ПолноеОписаниеОстатков;
	Форма.Элементы.ГруппаСпособВводаВОборот.ТолькоПросмотр = Форма.ПолноеОписаниеОстатков;
	
	ЭтоОбувь = (Форма.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувь"));
	ЭтоШины  = (Форма.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Шины"));
	ЭтоЛегкаяПромышленность = (Форма.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность"));
	ЭтоТабачнаяПродукция    = ИнтеграцияИСКлиентСервер.ЭтоПродукцияМОТП(Форма.ВидПродукции);
	
	Форма.Элементы.ЗаполнятьЦелевойПол.Видимость = ЭтоОбувь Или ЭтоЛегкаяПромышленность;
	Форма.Элементы.ЦелевойПол.Видимость    = ЭтоОбувь Или ЭтоЛегкаяПромышленность;
	
	Форма.Элементы.ЗаполнятьСпосовВводаВОборот.Видимость = ЭтоОбувь Или ЭтоЛегкаяПромышленность;
	Форма.Элементы.СпособВводаВОборот.Видимость          = ЭтоОбувь Или ЭтоЛегкаяПромышленность;
	
	Форма.Элементы.ЗаполнятьМодель.Видимость = ЭтоШины;
	Форма.Элементы.Модель.Видимость          = ЭтоШины;
	
	Форма.Элементы.ЗаполнятьВозрастнуюКатегорию.Видимость = ЭтоЛегкаяПромышленность;
	Форма.Элементы.ВозрастнаяКатегория.Видимость    = ЭтоЛегкаяПромышленность;
	
	Форма.Элементы.ЗаполнятьТоварныйЗнак.Видимость = Не ЭтоОбувь;
	Форма.Элементы.ТоварныйЗнак.Видимость          = Не ЭтоОбувь;
	
	Форма.Элементы.ЗаполнятьНаименование.Видимость = ЭтоТабачнаяПродукция;
	Форма.Элементы.Наименование.Видимость          = ЭтоТабачнаяПродукция;
	
	Форма.Элементы.СпособВводаВОборот.ТолькоПросмотр  = Не Форма.ЗаполнятьСпособВводаВОборот;
	Форма.Элементы.ЦелевойПол.ТолькоПросмотр          = Не Форма.ЗаполнятьЦелевойПол;
	Форма.Элементы.ВозрастнаяКатегория.ТолькоПросмотр = Не Форма.ЗаполнятьВозрастнуюКатегорию;
	Форма.Элементы.Модель.ТолькоПросмотр              = Не Форма.ЗаполнятьМодель;
	Форма.Элементы.ТоварныйЗнак.ТолькоПросмотр        = Не Форма.ЗаполнятьТоварныйЗнак;
	Форма.Элементы.ПолноеОписаниеОстатков.Видимость   = Не ЭтоТабачнаяПродукция;
	Форма.Элементы.Наименование.ТолькоПросмотр        = Не Форма.ЗаполнятьНаименование;
	
КонецПроцедуры

#КонецОбласти
